# `return` გამოიყენება ფუნქციაში შედეგის დასაბრუნებლად, რათა შემდეგ ეს მონაცემი სხვაგან გამოიყენოთ.
# მაგალითად:
def add(a, b):
    return a + b

# ხოლო `print` მხოლოდ გამოსახავს შედეგს ეკრანზე, მაგრამ არ აბრუნებს მნიშვნელობას.
# მაგალითად:
def greet(name):
    print(f"Hello, {name}!")

# Test Case არის წინასწარ განსაზღვრული სცენარი, რომელიც გამოიყენება პროგრამის ან ფუნქციის
# შედეგის სისწორის შესამოწმებლად.
# მაგალიად:
# თუ გვაქვს ფუნქცია add(a, b), რომელიც აბრუნებს ორი რიცხვის ჯამს,
# Test Case შეიძლება იყოს add(2, 3) → შედეგი: 5.
# Test Case-ები საშუალებას გვაძლევს დარწმუნდეთ, რომ კოდი სწორად მუშაობს ყველა შესაძლო სიტუაციაში.
